Reddit/app/models/user.rb

  def self.find_by_creds(username, password)
    user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "username"], ["LIMIT", 1]]

  def reset_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "m_aweSnyUBJtsOLQuB2Upw"], ["updated_at", "2019-04-09 18:50:35.437043"], ["id", 1]]