Reddit/app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."post_id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def new
    @post = Post.find_by(post_id: params[:id])

INSERT INTO "comments" ("content", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "comment"], ["author", 125], ["created_at", "2019-04-10 00:28:19.077315"], ["updated_at", "2019-04-10 00:28:19.077315"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.author = current_user.id
    # debugger
    @comment.post_id = params[:post_id]
    if @comment.save!