Reddit/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author = current_user.id

    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "sfasdf"], ["url", "sadfasd"], ["content", "asdfasdf"], ["author", 3], ["created_at", "2019-04-09 21:19:11.607647"], ["updated_at", "2019-04-09 21:19:11.607647"]]