Reddit/app/controllers/subs_controller.rb

    def create
      @sub = Sub.new(sub_params)

      @sub.moderator = current_user.id
      if @sub.save!
---
INSERT INTO "subs" ("title", "description", "moderator", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Sessions is awesome"], ["description", "asdfasdf"], ["moderator", 3], ["created_at", "2019-04-09 21:55:54.947112"], ["updated_at", "2019-04-09 21:55:54.947112"]]

    def show
      @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]