Reddit/app/views/subs/show.html.erb

<ul>
  <% @sub.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 6]]