Reddit/app/views/posts/show.html.erb

SELECT "subs".* FROM "subs" WHERE "subs"."post_id" = $1  [["post_id", 66]]
---
<ul>
  <% @post.subs.each do |sub| %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 70]]
---
<ul>
  <% @post.comments.each do |comment| %>